apache/nuttx/arch/arm/src/imxrt/imxrt_enc.c
  const struct qe_ops_s *ops;             /* Lower half callback structure */

  /* IMXRT driver-specific fields: */

  const struct imxrt_qeconfig_s *config;  /* static configuration */
  struct qe_index_s *data;
  mutex_t lock;                           /* Mutual exclusion mutex to
                                           * ensure atomic 32-bit reads.
                                           */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Helper functions */

static inline uint16_t imxrt_enc_getreg16
                        (struct imxrt_enc_lowerhalf_s *priv, int offset);
static inline void imxrt_enc_putreg16(struct imxrt_enc_lowerhalf_s *priv,
                                      int offset,  uint16_t value);
static inline void imxrt_enc_modifyreg16
                    (struct imxrt_enc_lowerhalf_s *priv, int offset,
                    uint16_t clearbits, uint16_t setbits);

static void imxrt_enc_clock_enable (uint32_t base);
static void imxrt_enc_clock_disable (uint32_t base);

static int imxrt_enc_reconfig(struct imxrt_enc_lowerhalf_s *priv,
                              uint16_t args);
static void imxrt_enc_set_initial_val(struct imxrt_enc_lowerhalf_s *priv,
                                      uint32_t value);
static void imxrt_enc_modulo_enable(struct imxrt_enc_lowerhalf_s *priv,
                                    uint32_t modulus);
static void imxrt_enc_modulo_disable(struct imxrt_enc_lowerhalf_s *priv);

static int imxrt_enc_index(int irq, void *context, void *arg);

#ifdef CONFIG_DEBUG_SENSORS
static int imxrt_enc_test_gen(struct imxrt_enc_lowerhalf_s *priv,
                              uint16_t value);
#endif

/* Lower-half Quadrature Encoder Driver Methods */

static int imxrt_setup(struct qe_lowerhalf_s *lower);
static int imxrt_shutdown(struct qe_lowerhalf_s *lower);
static int imxrt_position(struct qe_lowerhalf_s *lower,
                          int32_t *pos);
static int imxrt_reset(struct qe_lowerhalf_s *lower);
static int imxrt_ioctl(struct qe_lowerhalf_s *lower, int cmd,
                       unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* The lower half callback structure */

static const struct qe_ops_s g_qecallbacks =
{
  .setup     = imxrt_setup,
  .shutdown  = imxrt_shutdown,
  .position  = imxrt_position,
  .setposmax = NULL,            /* not supported yet */
  .reset     = imxrt_reset,
  .setindex  = NULL,            /* not supported yet */
  .ioctl     = imxrt_ioctl,
};

/* Per-timer state structures */

#ifdef CONFIG_IMXRT_ENC1
static const struct imxrt_qeconfig_s imxrt_enc1_config =
{
  .base        = IMXRT_ENC1_BASE,
  .irq         = IMXRT_IRQ_ENC1,
  .init_val    = CONFIG_ENC1_INITVAL,
  .modulus     = CONFIG_ENC1_MODULUS,
  .in_filt_per = CONFIG_ENC1_FILTPER,
  .in_filt_cnt = CONFIG_ENC1_FILTCNT,
  .init_flags  = CONFIG_ENC1_HIP << HIP_SHIFT |
                 CONFIG_ENC1_HNE << HNE_SHIFT |
                 CONFIG_ENC1_XIE << XIE_SHIFT |
                 CONFIG_ENC1_XIP << XIP_SHIFT |
                 CONFIG_ENC1_XNE << XNE_SHIFT |
                 CONFIG_ENC1_DIR << REV_SHIFT |
                 CONFIG_ENC1_MOD << MOD_SHIFT,

#ifdef CONFIG_DEBUG_SENSORS
  .tst_dir_adv = CONFIG_ENC1_TST_DIR,
  .tst_period  = CONFIG_ENC1_TST_PER,
#endif
};

static struct qe_index_s imxrt_enc1_data =
{
  .qenc_pos = 0,
  .indx_pos = 0,
  .indx_cnt = 0,
};

static struct imxrt_enc_lowerhalf_s imxrt_enc1_priv =
{
  .ops    = &g_qecallbacks,
  .config = &imxrt_enc1_config,
  .data   = &imxrt_enc1_data,
  .lock   = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_IMXRT_ENC2
static const struct imxrt_qeconfig_s imxrt_enc2_config =
{
  .base        = IMXRT_ENC2_BASE,
  .irq         = IMXRT_IRQ_ENC2,
  .init_val    = CONFIG_ENC2_INITVAL,
  .modulus     = CONFIG_ENC2_MODULUS,
  .in_filt_per = CONFIG_ENC2_FILTPER,
  .in_filt_cnt = CONFIG_ENC2_FILTCNT,
  .init_flags  = CONFIG_ENC2_HIP << HIP_SHIFT |
                 CONFIG_ENC2_HNE << HNE_SHIFT |
                 CONFIG_ENC2_XIE << XIE_SHIFT |
                 CONFIG_ENC2_XIP << XIP_SHIFT |
                 CONFIG_ENC2_XNE << XNE_SHIFT |
                 CONFIG_ENC2_DIR << REV_SHIFT |
                 CONFIG_ENC2_MOD << MOD_SHIFT,

#ifdef CONFIG_DEBUG_SENSORS
  .tst_dir_adv = CONFIG_ENC2_TST_DIR,
  .tst_period  = CONFIG_ENC2_TST_PER,
#endif
};

static struct qe_index_s imxrt_enc2_data =
{
  .qenc_pos = 0,
  .indx_pos = 0,
  .indx_cnt = 0,
};

static struct imxrt_enc_lowerhalf_s imxrt_enc2_priv =
{
  .ops    = &g_qecallbacks,
  .config = &imxrt_enc2_config,
  .data   = &imxrt_enc2_data,
  .lock   = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_IMXRT_ENC3
static const struct imxrt_qeconfig_s imxrt_enc3_config =
{
  .base        = IMXRT_ENC3_BASE,
  .irq         = IMXRT_IRQ_ENC3,
  .init_val    = CONFIG_ENC3_INITVAL,
  .modulus     = CONFIG_ENC3_MODULUS,
  .in_filt_per = CONFIG_ENC3_FILTPER,
  .in_filt_cnt = CONFIG_ENC3_FILTCNT,
  .init_flags  = CONFIG_ENC3_HIP << HIP_SHIFT |
                 CONFIG_ENC3_HNE << HNE_SHIFT |
                 CONFIG_ENC3_XIE << XIE_SHIFT |
                 CONFIG_ENC3_XIP << XIP_SHIFT |
                 CONFIG_ENC3_XNE << XNE_SHIFT |
                 CONFIG_ENC3_DIR << REV_SHIFT |
                 CONFIG_ENC3_MOD << MOD_SHIFT,

#ifdef CONFIG_DEBUG_SENSORS
  .tst_dir_adv = CONFIG_ENC3_TST_DIR,
  .tst_period  = CONFIG_ENC3_TST_PER,
#endif
};

static struct qe_index_s imxrt_enc3_data =
{
  .qenc_pos = 0,
  .indx_pos = 0,
  .indx_cnt = 0,
};

static struct imxrt_enc_lowerhalf_s imxrt_enc3_priv =
{
  .ops    = &g_qecallbacks,
  .config = &imxrt_enc3_config,
  .data   = &imxrt_enc3_data,
  .lock   = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_IMXRT_ENC4
static const struct imxrt_qeconfig_s imxrt_enc4_config =
{
  .base        = IMXRT_ENC4_BASE,
  .irq         = IMXRT_IRQ_ENC4,
  .init_val    = CONFIG_ENC4_INITVAL,
  .modulus     = CONFIG_ENC4_MODULUS,
  .in_filt_per = CONFIG_ENC4_FILTPER,
  .in_filt_cnt = CONFIG_ENC4_FILTCNT,
  .init_flags  = CONFIG_ENC4_HIP << HIP_SHIFT |
                 CONFIG_ENC4_HNE << HNE_SHIFT |
                 CONFIG_ENC4_XIE << XIE_SHIFT |
                 CONFIG_ENC4_XIP << XIP_SHIFT |
                 CONFIG_ENC4_XNE << XNE_SHIFT |
                 CONFIG_ENC4_DIR << REV_SHIFT |
                 CONFIG_ENC4_MOD << MOD_SHIFT,

#ifdef CONFIG_DEBUG_SENSORS
  .tst_dir_adv = CONFIG_ENC4_TST_DIR,
  .tst_period  = CONFIG_ENC4_TST_PER,
#endif
};

static struct qe_index_s imxrt_enc4_data =
{
  .qenc_pos = 0,
  .indx_pos = 0,
  .indx_cnt = 0,
};

static struct imxrt_enc_lowerhalf_s imxrt_enc4_priv =
{
  .ops    = &g_qecallbacks,
  .config = &imxrt_enc4_config,
  .data   = &imxrt_enc4_data,
  .lock   = NXMUTEX_INITIALIZER,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_enc_getreg16
 *
 * Description:
 *   Get a 16-bit register value by offset
 *
 ****************************************************************************/

